import Link from 'next/link'
import React from 'react'

const LeftSideBar = () => {
    return (
        <article className='flex flex-col py-[50px] pr-[30px] gap-5 border-right-gradient min-h-[calc(100vh-100px)] w-[260px]'>
            <div className="flex flex-col gap-2 w-[260px] sticky top-[100px] pr-[30px]">
                <div className="text-[18px] font-medium text-nowrap py-3 pl-[21px] pr-[142px] rounded-[6px] cursor-pointer bg-gray15 text-gray8f">팩터 전략</div>
                <div className="text-[18px] font-medium text-nowrap py-3 pl-[21px] pr-[142px] rounded-[6px] cursor-pointer text-white bg-gray1e">자산배분</div>
                <div className="text-[18px] font-medium text-nowrap py-3 pl-[21px] pr-[142px] rounded-[6px] cursor-pointer bg-gray15 text-gray8f">전략 예시</div>
                <div className="text-[18px] font-medium text-nowrap py-3 pl-[21px] pr-[142px] rounded-[6px] cursor-pointer bg-gray15 text-gray8f">파트너십</div>
                <div className="flex-shrink-0 border-none" style={{ backgroundColor: 'rgb(37, 37, 37)', width: '100%', height: '1px' }} />
                <div className="flex flex-col gap-[16px] py-[12px] px-[16px]">
                    <Link className="body-1-normal-medium text-graycf flex gap-[6px] items-center" href="#a">
                        이용 가이드
                        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                            <path d="M14.9974 9.01699C14.7764 9.01699 14.5644 9.10479 14.4081 9.26107C14.2519 9.41735 14.1641 9.62931 14.1641 9.85032V15.8337C14.1641 16.0547 14.0763 16.2666 13.92 16.4229C13.7637 16.5792 13.5517 16.667 13.3307 16.667H4.16406C3.94305 16.667 3.73109 16.5792 3.57481 16.4229C3.41853 16.2666 3.33073 16.0547 3.33073 15.8337V6.66699C3.33073 6.44598 3.41853 6.23402 3.57481 6.07774C3.73109 5.92146 3.94305 5.83366 4.16406 5.83366H10.1474C10.3684 5.83366 10.5804 5.74586 10.7367 5.58958C10.8929 5.4333 10.9807 5.22134 10.9807 5.00033C10.9807 4.77931 10.8929 4.56735 10.7367 4.41107C10.5804 4.25479 10.3684 4.16699 10.1474 4.16699H4.16406C3.50102 4.16699 2.86514 4.43038 2.3963 4.89923C1.92745 5.36807 1.66406 6.00395 1.66406 6.66699V15.8337C1.66406 16.4967 1.92745 17.1326 2.3963 17.6014C2.86514 18.0703 3.50102 18.3337 4.16406 18.3337H13.3307C13.9938 18.3337 14.6297 18.0703 15.0985 17.6014C15.5673 17.1326 15.8307 16.4967 15.8307 15.8337V9.85032C15.8307 9.62931 15.7429 9.41735 15.5867 9.26107C15.4304 9.10479 15.2184 9.01699 14.9974 9.01699ZM18.2641 2.18366C18.1795 1.98003 18.0177 1.81822 17.8141 1.73366C17.7139 1.69096 17.6063 1.66831 17.4974 1.66699H12.4974C12.2764 1.66699 12.0644 1.75479 11.9081 1.91107C11.7519 2.06735 11.6641 2.27931 11.6641 2.50033C11.6641 2.72134 11.7519 2.9333 11.9081 3.08958C12.0644 3.24586 12.2764 3.33366 12.4974 3.33366H15.4891L6.90573 11.9087C6.82762 11.9861 6.76563 12.0783 6.72332 12.1798C6.68101 12.2814 6.65923 12.3903 6.65923 12.5003C6.65923 12.6103 6.68101 12.7193 6.72332 12.8208C6.76563 12.9224 6.82762 13.0145 6.90573 13.092C6.9832 13.1701 7.07537 13.2321 7.17692 13.2744C7.27846 13.3167 7.38739 13.3385 7.4974 13.3385C7.60741 13.3385 7.71633 13.3167 7.81788 13.2744C7.91943 13.2321 8.01159 13.1701 8.08906 13.092L16.6641 4.50866V7.50033C16.6641 7.72134 16.7519 7.9333 16.9081 8.08958C17.0644 8.24586 17.2764 8.33366 17.4974 8.33366C17.7184 8.33366 17.9304 8.24586 18.0867 8.08958C18.2429 7.9333 18.3307 7.72134 18.3307 7.50033V2.50033C18.3294 2.39143 18.3068 2.28384 18.2641 2.18366Z" fill="#8F8F8F">
                            </path>
                        </svg>
                    </Link>
                    <p className="text-[12px] leading-[150%] text-gray8f">퀀트가 처음이신가요?<br />이용 가이드로 쉽게 시작하세요.</p>
                </div>
            </div>

        </article>
    )
}

export default LeftSideBar